<a href="https://colab.research.google.com/github/Shogo-dayo/Shogo-dayo.github.io/blob/master/nlp100_2nd.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import os
import re
import numpy as np
import pandas as pd

In [ ]:
os.listdir()

['.config', 'sample_data']

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [ ]:
os.listdir()

['.config', 'drive', 'sample_data']

In [ ]:
df = pd.read_csv("drive/MyDrive/Study/MachineLearning/nlp/nlp100/popular-names.txt", sep='\t', header=None)
df.head()

           0  1     2     3
0       Mary  F  7065  1880
1       Anna  F  2604  1880
2       Emma  F  2003  1880
3  Elizabeth  F  1939  1880
4     Minnie  F  1746  1880

10. 行数をカウントせよ．確認にはwcコマンドを用いよ．

In [ ]:
len(df)

2780

11. タブ1文字につきスペース1文字に置換せよ．確認にはsedコマンド，trコマンド，もしくはexpandコマンドを用いよ

In [ ]:
df.to_csv('drive/MyDrive/Study/MachineLearning/nlp/nlp100/ans11.txt', sep=' ', index=False, header=None)

12. 各行の1列目だけを抜き出したものをcol1.txtに，2列目だけを抜き出したものをcol2.txtとしてファイルに保存せよ．確認にはcutコマンドを用いよ．

In [ ]:
df[0].to_csv('drive/MyDrive/Study/MachineLearning/nlp/nlp100/col1.txt',index=False, header=None)
df[1].to_csv('drive/MyDrive/Study/MachineLearning/nlp/nlp100/col2.txt',index=False, header=None)

13. 12で作ったcol1.txtとcol2.txtを結合し，元のファイルの1列目と2列目をタブ区切りで並べたテキストファイルを作成せよ．確認にはpasteコマンドを用いよ．

In [ ]:
col1_df = pd.read_csv('drive/MyDrive/Study/MachineLearning/nlp/nlp100/col1.txt', header=None)
col2_df = pd.read_csv('drive/MyDrive/Study/MachineLearning/nlp/nlp100/col2.txt', header=None)
colMerge_df = pd.concat([col1_df, col2_df],axis=1)
colMerge_df.to_csv('drive/MyDrive/Study/MachineLearning/nlp/nlp100/ans13.txt', sep='\t', index=False, header=None)

14. 自然数Nをコマンドライン引数などの手段で受け取り，入力のうち先頭のN行だけを表示せよ．確認にはheadコマンドを用いよ．

In [ ]:
colMerge_df.head(5)

           0  0
0       Mary  F
1       Anna  F
2       Emma  F
3  Elizabeth  F
4     Minnie  F

15. 自然数Nをコマンドライン引数などの手段で受け取り，入力のうち末尾のN行だけを表示せよ．確認にはtailコマンドを用いよ．

In [ ]:
colMerge_df.tail(5)

             0  0
2775  Benjamin  M
2776    Elijah  M
2777     Lucas  M
2778     Mason  M
2779     Logan  M

16. 自然数Nをコマンドライン引数などの手段で受け取り，入力のファイルを行単位でN分割せよ．同様の処理をsplitコマンドで実現せよ．

In [ ]:
colMerge_df.iloc[:2, :]

      0  0
0  Mary  F
1  Anna  F

In [ ]:
colMerge_df.iloc[2:, :]

              0  0
2          Emma  F
3     Elizabeth  F
4        Minnie  F
5      Margaret  F
6           Ida  F
...         ... ..
2775   Benjamin  M
2776     Elijah  M
2777      Lucas  M
2778      Mason  M
2779      Logan  M

[2778 rows x 2 columns]

17. 1列目の文字列の種類（異なる文字列の集合）を求めよ．確認にはcut, sort, uniqコマンドを用いよ．

In [ ]:
np.unique(colMerge_df[0])

array(['Abigail', 'Aiden', 'Alexander', 'Alexis', 'Alice', 'Amanda',
       'Amelia', 'Amy', 'Andrew', 'Angela', 'Anna', 'Annie', 'Anthony',
       'Ashley', 'Austin', 'Ava', 'Barbara', 'Benjamin', 'Bertha',
       'Bessie', 'Betty', 'Brandon', 'Brian', 'Brittany', 'Carol',
       'Carolyn', 'Charles', 'Charlotte', 'Chloe', 'Christopher', 'Clara',
       'Crystal', 'Cynthia', 'Daniel', 'David', 'Deborah', 'Debra',
       'Donald', 'Donna', 'Doris', 'Dorothy', 'Edward', 'Elijah',
       'Elizabeth', 'Emily', 'Emma', 'Ethan', 'Ethel', 'Evelyn', 'F',
       'Florence', 'Frances', 'Frank', 'Gary', 'George', 'Hannah',
       'Harper', 'Harry', 'Heather', 'Helen', 'Henry', 'Ida', 'Isabella',
       'Jacob', 'James', 'Jason', 'Jayden', 'Jeffrey', 'Jennifer',
       'Jessica', 'Joan', 'John', 'Joseph', 'Joshua', 'Judith', 'Julie',
       'Justin', 'Karen', 'Kathleen', 'Kelly', 'Kimberly', 'Larry',
       'Laura', 'Lauren', 'Liam', 'Lillian', 'Linda', 'Lisa', 'Logan',
       'Lori', 'Lucas', 'M', 'Madison', 'Margaret', 'Marie', 'Mark',
       'Mary', 'Mason', 'Matthew', 'Megan', 'Melissa', 'Mia', 'Michael',
       'Michelle', 'Mildred', 'Minnie', 'Nancy', 'Nicholas', 'Nicole',
       'Noah', 'Oliver', 'Olivia', 'Pamela', 'Patricia', 'Rachel',
       'Rebecca', 'Richard', 'Robert', 'Ronald', 'Ruth', 'Samantha',
       'Sandra', 'Sarah', 'Scott', 'Sharon', 'Shirley', 'Sophia',
       'Stephanie', 'Steven', 'Susan', 'Tammy', 'Taylor', 'Thomas',
       'Tracy', 'Tyler', 'Virginia', 'Walter', 'William'], dtype=object)

18. 各行を3コラム目の数値の逆順で整列せよ（注意: 各行の内容は変更せずに並び替えよ）．確認にはsortコマンドを用いよ（この問題はコマンドで実行した時の結果と合わなくてもよい）．

In [ ]:
df.sort_values(2, ascending="False")

            0  1      2     3
9       Sarah  F   1288  1880
29      Alice  F   1308  1881
8      Bertha  F   1320  1880
28     Bertha  F   1324  1881
27      Annie  F   1326  1881
...       ... ..    ...   ...
1351   Robert  M  91640  1947
1550  Michael  M  92704  1957
1350    James  M  94757  1947
1360    Linda  F  96211  1948
1340    Linda  F  99689  1947

[2780 rows x 4 columns]

19. 各行の1列目の文字列の出現頻度を求め，その高い順に並べて表示せよ．確認にはcut, uniq, sortコマンドを用いよ．

In [ ]:
df[0].value_counts()

James      118
William    111
John       108
Robert     108
Mary        92
          ...
Kelly        1
Tracy        1
Pamela       1
Laura        1
Rachel       1
Name: 0, Length: 136, dtype: int64